var config = {
    style: 'mapbox://styles/vheritage/ckq5s9man3m6b17o0mtgj7vay',
    accessToken: 'pk.eyJ1Ijoidmhlcml0YWdlIiwiYSI6ImNrb3UwNHIzNzAyMG0yd3FqZGdiejFxOTEifQ._ABN33UTZQGAwfZCiub-yQ',
    showMarkers: true,
    markerColor: '#ff6d00',
    theme: 'light',
    use3dTerrain: false,
    //title: 'Културен маршрут Одесос-Варна',
    //subtitle: 'A descriptive and interesting subtitle to draw in the reader',
    //byline: 'Културното наследство на Варна като туристическа дестинация',
    //footer: 'varnaheritage.com',
    chapters: [
        {
            id: 'object-1',
            alignment: 'right',
            hidden: false,
            title: ' Зараждане на Одесос – обща характеристика на археологическото наследство',
            //image: 'https://uploads-ssl.webflow.com/5e89dbc0ec626fb32b2db7fd/5fc2814169f35bf6a1273368_Тумб.jpg',
            description: 'Археологически резерват „Одесос” е обявен с Разпореждане на Министерски съвет №76 от 27.04.1974г. Границите на резервата обхващат обширна зона в централната част на Варна, където във времето са разкрити множество археологически обекти. Най- ранните от тях, спадат към елинистичната епоха и се свързват с поселването на морските брегове от изселническите движения от Егейска Гърция. Античният град - колония Одесос е основан през втората четвърт на VIв. пр. Хр. (580-550г.пр.Хр.) от малоазийски изселници от йонийския град - държава Милет.',
            location: {
                center: [27.91919, 43.20342],
                zoom: 14,
                pitch: 0,
                bearing: -87.20
            },
            mapAnimation: 'flyTo',
            rotateAnimation: false,
            callback: '',
            onChapterEnter: [
                // {
                //     layer: 'layer-name',
                //     opacity: 1,
                //     duration: 5000
                // }
            ],
            onChapterExit: [
                // {
                //     layer: 'layer-name',
                //     opacity: 0
                // }
            ]
        },
        {
            id: 'object-2',
            alignment: 'right',
            hidden: false,
            //title: 'Стратиграфия, исторически и културни наслоявания и влияния. Античност.',
            //image: 'https://uploads-ssl.webflow.com/5e89dbc0ec626fb32b2db7fd/5fc2814169f35bf6a1273368_Тумб.jpg',
            description: 'Разкритите археологически обекти са с различна датировка и биват няколко вида: обществени, култови и жилищни сгради,  комуникационни структури и съоръжения на техническата инфраструктура (улици, канали). Множеството открити части от фортификационни съоръжения (крепостни стени и кули) дават информация за границите на града и отчасти за неговото градоустройство. Всяко ново откритие предоставя на учените нови данни, които допринасят за изясняването на функциите и историята на крепостните съоръжения и обхвата на града в различните епохи.',
            location: {
                center: [27.91919, 43.20342],
                zoom: 16,
                pitch: 0,
                bearing: -123.20
            },
            mapAnimation: 'flyTo',
            rotateAnimation: false,
            callback: '',
            onChapterEnter: [],
            onChapterExit: []
        },
        {
            id: 'object-3',
            alignment: 'right',
            hidden: false,
            title: 'Кратка междинна спирка',
            //image: 'https://uploads-ssl.webflow.com/5e89dbc0ec626fb32b2db7fd/5fc40b7d2f53753f66fc626d_Тумб-Recovered.jpg',
            description: 'Тук е пресечната точка на махалите – гръцка (най старата), арменска, гагаузка, еврейска, съществували до освобождението. Оттук е останало името на квартала „гръцка махала”.',
            location: {
                center: [27.91804, 43.20232],
                zoom: 18,
                pitch: 60.00,
                bearing: -172.80
            },
            mapAnimation: 'flyTo',
            rotateAnimation: false,
            callback: '',
            onChapterEnter: [],
            onChapterExit: []
        },
            {
            id: 'object-4',
            alignment: 'right',
            hidden: false,
            title: 'Стратиграфия, исторически и културни наслоявания и влияния. Античност.',
            //image: 'https://uploads-ssl.webflow.com/5e89dbc0ec626fb32b2db7fd/5eb7c8589c6a7d262efc3663_388_thumb.jpeg',
            description: 'Централната зона на град Варна се харакеризира с изключително богата стратиграфия и културно разнообразие. Археологическите обекти на територията на резервата имат различна датировка, а на много места културните пластове (между 4 и 8м.) са един върху друг, като ясно личат връзките и различията между тях. Тук се срещат свидетелства на тракийска, прабългарска, елинистична, римска, византийска, османска и българска култури, които заедно съзадават мултикултурния автентичен облик на днешна Варна.',
            location: {
                center: [27.91788, 43.20151],
                zoom: 17.81,
                pitch: 44,
                bearing: 153.60
            },
            mapAnimation: 'flyTo',
            rotateAnimation: false,
            callback: '',
            onChapterEnter: [],
            onChapterExit: []
        },
            {
            id: 'object-5',
            alignment: 'left',
            hidden: false,
            //title: '',
            //image: 'https://uploads-ssl.webflow.com/5e89dbc0ec626fb32b2db7fd/5fc40b7d2f53753f66fc626d_Тумб-Recovered.jpg',
            description: 'Историческото ядро на града се характеризира с изключителна интензивност на културно-исторически обекти и археологически недвижими културни ценности. Основна част от тях са от античността и средновековието. След своя апогей през III и II в. пр.Хр. античният Одесос преминава окончателно в пределите на Рим през 15г. сл.Хр., като запазва своето самоуправление и активни търговски функции. Този период е продължил чак до късната античност, като бил белязан от постоянни конфликти и нашествия от северните народи (готи, хуни, авари, славяни, прабългари). Последните антични сведения са датирани от от 610-640г',
            location: {
                center: [27.91788, 43.20151],
                zoom: 17,
                pitch: 0,
                bearing: 104.00
            },
            mapAnimation: 'flyTo',
            rotateAnimation: false,
            callback: '',
            onChapterEnter: [],
            onChapterExit: []
        },
            {
            id: 'object-6',
            alignment: 'right',
            hidden: false,
            title: 'Средновековие и преход към османски и възрожденски период',
            //image: 'https://uploads-ssl.webflow.com/5e89dbc0ec626fb32b2db7fd/5fc40b7d2f53753f66fc626d_Тумб-Recovered.jpg',
            description: 'Градът се възражда през 10в., когато България е под Византийска власт. Разцъфтява икономически, социално и културно чрез активната си търговска функция и усвоява бързо Византийската култура. На 24 март 1201г. цар Калоян отново приобщава Варна към Българската държава, а Варна става неин основен търговски център. Средновековният град е бил значително по-малък, ограден с крепостна стена, построена още през византисйкия период, с няколко църкви и жилищни сгради, разположени на тесни улици. Със завладяването на града от турските войски през 1389г. настъпва период на Османска власт и внасяне на източен, ориенталски културен слой. Археологическите находки на култови и жилищни сгради са множество, но само някои от тях са социализирани, а значително количество керамика и монети от периода могат да бъдат видяни от посетители на града в Регионален исторически музей – Варна',
            location: {
                center: [27.91748, 43.20001],
                zoom: 17.5,
                pitch: 40,
                bearing: 96
            },
            mapAnimation: 'flyTo',
            rotateAnimation: false,
            callback: '',
            onChapterEnter: [],
            onChapterExit: []
        },
        {
            id: 'object-7',
            alignment: 'right',
            hidden: false,
            title: 'Oсмански и възрожденски период и преход към европейските ценности',
            //image: 'https://uploads-ssl.webflow.com/5e89dbc0ec626fb32b2db7fd/5fc40b7d2f53753f66fc626d_Тумб-Recovered.jpg',
            description: 'По времето на робството Варна придобива всички характеристики на османски град - ограден е с крепостни стени, а вътрешността му е прорязана от тесни и тъмни улици. Жилищните сгради са основно паянтови(дървени), а прозорците им са гледали към вътрешните дворове, избягвайки мръсотията извън кварталните пространства. Градоустройството е типично за средновековен град с етнически квартали, които функционират като затворени общества. Композиционни акценти в историческия силует са представлявали 17 джамии с техните минарета. Запазени са изключително малко образци от този период, с изключение на няколко жилищни, обществени и складови/търговски сгради. Забележителни са останалите каменни чешми от този период (Икономически техникум, Скеле капу – в морската градина и др.). Появата на голям брой консулски служби във Варна през втората половина на XIXв. е доказателство за международното признание на града. Вече е  осезаемо сериозното европейско влияние и възприемане на нови западни културни и социални ценности. Градът бива освободен на 27 Юли 1878г. Развива се бързо и навлиза в Новата история с активни търговско, културно, социално значение.',
            location: {
                center: [27.91547, 43.19967],
                zoom: 17.2,
                pitch: 16.50,
                bearing: 148.20
            },
            mapAnimation: 'flyTo',
            rotateAnimation: false,
            callback: '',
            onChapterEnter: [],
            onChapterExit: []
        },
        {
            id: 'object-8',
            alignment: 'left',
            hidden: false,
            title: 'Нова история на Варна – съвременно градоустройство и строителство',
            //image: 'https://uploads-ssl.webflow.com/5e89dbc0ec626fb32b2db7fd/5fc40b7d2f53753f66fc626d_Тумб-Recovered.jpg',
            description: 'След Освобождението и разрушаването на крепостната стена се заселват много българи от Северна Добруджа, Бесарабия, Тракия и Македония, се развива Ени махале (българската махала) Българското население значително нараства. Градът продължава се развива като важен търговски, пристанищен и индустриален център. Изграждат се памукотекстилни, корабостроителни и кораборемонтни предприятия. През мандата на Кръстьо Мирски като кмет на Варна през годините 1888 – 1890 г. се осъществява грандиозна програма за изправяне и разширяване на улиците. През 1906 г. е открито и модерно пристанище с вълнолом във Варненския залив. Градът се превръща в център за изучаване на морето и използване на неговите богатства. Построена е зоологическа станция с аквариум. В ориенталския вид на града започва да се установяват европейски влияния. Редица млади архитекти и инженери, завършили в чужбина работят за благоустрояването на Варна, създавайки десетки нови частни и обществени сгради, повечето от които и до днес носят статут на паметници на архитектурата.',
            location: {
                center: [27.91608, 43.20047],
                zoom: 17.2,
                pitch: 60,
                bearing: 132.00
            },
            mapAnimation: 'flyTo',
            rotateAnimation: false,
            callback: '',
            onChapterEnter: [],
            onChapterExit: []
        }
    ]
};
